book/assets/assessments/installEmacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-13 Fri 13:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Install Package - Emacs Assessment</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Install Package - Emacs Assessment</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc438c36">1. Task</a></li>
<li><a href="#org555e444">2. Details</a></li>
<li><a href="#orgc32f6ab">3. Comments</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc438c36" class="outline-2">
<h2 id="orgc438c36"><span class="section-number-2">1.</span> Task</h2>
<div class="outline-text-2" id="text-1">
<p>
Demonstrate that you have a functioning Linux installation and that you can use the package management system. 
</p>
</div>
</div>

<div id="outline-container-org555e444" class="outline-2">
<h2 id="org555e444"><span class="section-number-2">2.</span> Details</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Open up a terminal. In Xubuntu go to the upper left of your desktop and click the icon. Type terminal in the search bar and select the top option.</li>
<li>When the terminal opens type <code>sudo apt update</code> to update your list of currently available packages. This package manager works for Xubuntu, but will not be found on all Linux distributions.</li>
<li>Type <code>sudo apt install emacs</code></li>
<li>Follow the on screen instructions. When installation is complete type, in the same terminal window, <code>emacs &amp;</code>.</li>
<li>Emacs will open. Use the <code>File</code> menu to create a new file with a sensible name in the file itself type in your name and student id and save the file as type <code>.org</code>. Make a note of where you save it, because you will need to &#x2026;</li>
<li>Log on to learn and submit the file.</li>
</ol>
</div>
</div>

<div id="outline-container-orgc32f6ab" class="outline-2">
<h2 id="orgc32f6ab"><span class="section-number-2">3.</span> Comments</h2>
<div class="outline-text-2" id="text-3">
<p>
If you want to try something fun open the file back up in emacs after doing the above. Then type <code>C-c C-e h h</code>. <code>C-c</code> means typing the "Ctrl" key and the lower case "c" key simultaneously. The spaces between those instructions mean you have a sequence of four key chords to enter. If all goes well you have just created a web page of that file. You should be able to open it in your browser. To test, use the file browser in Xubuntu to navigate to the file with the name you used above, but now ending in <code>.html</code> and not the <code>.org</code> one. Double click and your web browser should open with that file displayed.
</p>

<p>
To get ahead of things and learn more about the org-mode utilities you just used you can search for emacs and orgmode online. Or type <code>C-h i</code> to open the information functionality and navigate to the orgmode chapter.
</p>

<p>
And if you get stressed you can always consult Emacs' built in therapist with <code>M-x doctor</code>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-01-13 Fri 13:17</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>